#+TITLE: emacs configuration
#+AUTHOR: Thomas
#+PROPERTY: header-args :tangle no
#+STARTUP: show3levels

**** ob-http

from: https://github.com/zweifisch/ob-http

#+begin_src emacs-lisp
  (use-package ob-http
    :ensure t
    :defer t
    :after org
    :config
    ;; Add ob-http to the list of org-babel languages
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (http . t)
       )))
#+end_src

Example (C-c C-c):
#+BEGIN_SRC http :pretty
GET http://httpbin.org/user-agent
User-Agent: ob-http
#+END_SRC

#+RESULTS:
: {
:   "user-agent": "ob-http"
: }

*** info

current enabled themes
#+begin_src emacs-lisp :tangle no
   (message "%s" custom-enabled-themes)
#+end_src

#+RESULTS:
: nil

available themes
#+begin_src emacs-lisp :tangle no
  (custom-available-themes)
#+end_src

#+RESULTS:
| adwaita | deeper-blue | dichromacy | leuven-dark | leuven | light-blue | manoj-dark | misterioso | modus-operandi | modus-vivendi | tango-dark | tango | tsdh-dark | tsdh-light | wheatgrass | whiteboard | wombat |

#+begin_src emacs-lisp
  (defun em/disable-all-themes ()
    "Disable all active themes."
    (interactive)
    (mapc #'disable-theme custom-enabled-themes))
#+end_src

#+begin_src emacs-lisp :tangle no
  (em/disable-all-themes)
#+end_src

